borodark/OS-II/erts/example/mini_beam_esp32/zephyr_app/src/main.c
#if defined(CONFIG_USB_DEVICE_STACK)
    {
        const struct device *const console_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_console));
        uint32_t dtr = 0;
        int wait_ms = 0;

        /* Bring up USB CDC ACM so logs are visible on /dev/ttyACM*. */
        (void)usb_enable(NULL);
        while (wait_ms < 3000U) {
            if (uart_line_ctrl_get(console_dev, UART_LINE_CTRL_DTR, &dtr) == 0 && dtr) {
                break;
            }
            k_msleep(100);
            wait_ms += 100;
        }
    }
#endif

    LOG_INF("mini_beam_nrf52 start");
    LOG_INF("event schema v%d", OS2_EVENT_SCHEMA_VERSION);
    os2_log_caps_v1();
    boot_counter = os2_boot_counter_next();
    LOG_INF("boot counter=%u resetreas=0x%08x", (unsigned)boot_counter, resetreas_raw);
    NRF_POWER->RESETREAS = resetreas_raw;

#if OS2_ENABLE_TASK_WDT
    wdt_channel = os2_task_wdt_start();
    if (wdt_channel < 0) {
        LOG_ERR("task_wdt init failed rc=%d", wdt_channel);
        return wdt_channel;
    }
    LOG_INF("task_wdt enabled timeout_ms=%u grace_ms=%u",
        OS2_WDT_TIMEOUT_MS, OS2_WDT_DEGRADED_GRACE_MS);
#else
    LOG_WRN("task_wdt disabled via OS2_ENABLE_TASK_WDT=0");
#endif

    os2_try_enable_i2c_pullups();
    k_msleep(50);
    target_count = os2_i2c_signature_scan(targets, ARRAY_SIZE(targets));

    /* Two-process flow from compiled .flow file */
    mb_sched_init(&sched);
    pid_sensor = mb_sched_spawn(&sched, os2_flow_sensor_prog,
                                 sizeof(os2_flow_sensor_prog));
    pid_actuator = mb_sched_spawn(&sched, os2_flow_actuator_prog,
                                   sizeof(os2_flow_actuator_prog));
    proc_s = mb_sched_proc(&sched, pid_sensor);
    proc_a = mb_sched_proc(&sched, pid_actuator);
    LOG_INF("flow: sensor pid=%u (%u bytes) actuator pid=%u (%u bytes)",
            pid_sensor, (unsigned)sizeof(os2_flow_sensor_prog),
            pid_actuator, (unsigned)sizeof(os2_flow_actuator_prog));

    /*
     * Main loop: the flow-compiled programs are self-driving.
     * Sensor process polls I2C and SENDs to actuator on its own schedule.
     * Actuator process blocks on RECV_CMD and calls PWM BIF.
     * Native code ticks the scheduler and emits telemetry.
     */
    while (1) {
        uint32_t now_ms;
        int32_t sensor_val, sensor_ts;

        rc = mb_sched_tick(&sched);
        if (rc != MB_OK && rc != MB_SCHED_IDLE) {
            LOG_ERR("sched failed rc=%d sensor(state=%d err=%d pc=%u) actuator(state=%d err=%d pc=%u)",
                    rc,
                    proc_s->state, proc_s->last_error, (unsigned)proc_s->pc,
                    proc_a->state, proc_a->last_error, (unsigned)proc_a->pc);
            return rc;
        }

        /* Read sensor process registers for telemetry.
         * Flow register plan: r7=i2c_value, r9=timestamp */
        sensor_val = MB_GET_SMALLINT(proc_s->regs[7]);
        sensor_ts = MB_GET_SMALLINT(proc_s->regs[9]);

        if (sensor_ts != 0 && (uint32_t)sensor_ts != last_ts) {
            int32_t status = (sensor_val < 0) ? OS2_EVENT_STATUS_IO_ERROR : OS2_EVENT_STATUS_OK;
            LOG_INF("event sensor=%d:%d value=%d ts=%u status=%d | actuator r0=%d r2=%d",
                    MB_GET_SMALLINT(proc_s->regs[1]),  /* addr */
                    MB_GET_SMALLINT(proc_s->regs[2]),  /* reg */
                    sensor_val,
                    (uint32_t)sensor_ts,
                    status,
                    MB_GET_SMALLINT(proc_a->regs[0]),  /* last cmd type */
                    MB_GET_SMALLINT(proc_a->regs[2])); /* last duty value */
            last_ts = (uint32_t)sensor_ts;
            mb_stats.processed++;
        }

        now_ms = k_uptime_get_32();
        if ((now_ms - last_stats_ts) >= OS2_STATS_LOG_PERIOD_MS) {
            LOG_INF("flow_stats ticks=%u sensor(state=%d gc=%u) actuator(state=%d gc=%u) s_mbox=%u/%u a_mbox=%u/%u",
                    mb_stats.processed,
                    proc_s->state, proc_s->heap.gc_count,
                    proc_a->state, proc_a->heap.gc_count,
                    (unsigned)proc_s->mailbox.count, (unsigned)MB_MAILBOX_CAPACITY,
                    (unsigned)proc_a->mailbox.count, (unsigned)MB_MAILBOX_CAPACITY);
            last_stats_ts = now_ms;
        }

#if OS2_ENABLE_TASK_WDT
        if (task_wdt_feed(wdt_channel) < 0) {
            LOG_ERR("task_wdt feed failed");
            return -1;
        }
#endif
        if (rc == MB_SCHED_IDLE) {
            k_msleep(10);
        }
    }

    return 0;
}
